In [47]:
import pandas as pd

In [48]:
import xlrd

Reads the Excel file.

In [50]:
df = pd.read_excel('Path where you want to read the Excel file/PD 2021 Wk 1 Input.xls')

In [51]:
df

,Order ID,Customer Age,Bike Value,Existing Customer?,Date,Store - Bike
0,1,22,481,No,2021-04-25,York - Road
1,2,28,1825,No,2021-01-23,York - Road
2,3,51,1903,No,2021-07-03,York - Rood
3,4,59,1059,No,2021-01-24,York - Road
4,5,44,1764,Yes,2021-08-12,York - Mountain
...,...,...,...,...,...,...
995,996,42,3460,No,2021-09-03,London - Mountain
996,997,48,3409,No,2021-01-17,London - Mountain
997,998,81,2534,No,2021-03-26,London - Mountain
998,999,37,4312,Yes,2021-05-25,London - Gravel
999,1000,35,1200,Yes,2021-02-18,Leeds - Graval

Split the 'Store-Bike' field into 'Store'

In [52]:
df['Store'] = df['Store - Bike'].str.split('-').str[0]

In [53]:
df['Store']

0        York
1        York
2        York
3        York
4        York
        ...
995    London
996    London
997    London
998    London
999     Leeds
Name: Store, Length: 1000, dtype: object

Split the 'Store-Bike' field into 'Bike'

In [54]:
df['Bike'] = df['Store - Bike'].str.split('-').str[-1]

Find unique values in a Bike column

In [55]:
df['Bike'].unique()

array([' Road', ' Rood', ' Mountain', ' Gravel', ' Mountaen', ' Graval',
       ' Rowd', ' Gravle'], dtype=object)

Clean up the 'Bike' field to leave just three values in the 'Bike' field (Mountain, Gravel, Road)

In [56]:
df['Bike (new)'] = df['Bike'].replace({' Rood':'Road', ' Rowd':'Road', ' Mountaen':'Mountain', ' Graval':'Gravel', ' Gravle':'Gravel'})

In [57]:
df['Bike (new)']

0           Road
1           Road
2           Road
3           Road
4       Mountain
         ...
995     Mountain
996     Mountain
997     Mountain
998       Gravel
999       Gravel
Name: Bike (new), Length: 1000, dtype: object

Delete old "bike" field

In [58]:
del df['Bike']

Creates new Day of Month and Quarter columns from Date field

In [59]:
df['Day of Month'] = pd.DatetimeIndex(df['Date']).month

In [60]:
df['Quarter'] = df['Date'].dt.quarter

In [61]:
df['Bike'] = df['Bike (new)']

Drops unneeded columns

In [40]:
new_df = df.drop(columns=['Date', 'Month', 'Store - Bike', 'Bike (new)'])

In [42]:
new_df

,Order ID,Customer Age,Bike Value,Existing Customer?,Store,Day of Month,Quarter,Bike
0,1,22,481,No,York,4,2,Road
1,2,28,1825,No,York,1,1,Road
2,3,51,1903,No,York,7,3,Road
3,4,59,1059,No,York,1,1,Road
4,5,44,1764,Yes,York,8,3,Mountain
...,...,...,...,...,...,...,...,...
995,996,42,3460,No,London,9,3,Mountain
996,997,48,3409,No,London,1,1,Mountain
997,998,81,2534,No,London,3,1,Mountain
998,999,37,4312,Yes,London,5,2,Gravel
999,1000,35,1200,Yes,Leeds,2,1,Gravel

Drop first 10 rows in the new dataframe

In [44]:
N = 10
new_df = new_df.tail(df.shape[0] -N)

Check new dataframe output

In [45]:
new_df

,Order ID,Customer Age,Bike Value,Existing Customer?,Store,Day of Month,Quarter,Bike
10,11,57,902,No,Birmingham,10,4,Road
11,12,31,946,Yes,Leeds,1,1,Road
12,13,17,1296,Yes,Birmingham,10,4,Road
13,14,59,1166,Yes,Manchester,7,3,Road
14,15,24,1781,No,Manchester,10,4,Mountain
...,...,...,...,...,...,...,...,...
995,996,42,3460,No,London,9,3,Mountain
996,997,48,3409,No,London,1,1,Mountain
997,998,81,2534,No,London,3,1,Mountain
998,999,37,4312,Yes,London,5,2,Gravel
999,1000,35,1200,Yes,Leeds,2,1,Gravel

Exports clean dataframe as csv

In [46]:
new_df.to_csv('Path where you want to store the exported CSV file\PreppinDataChallenge 2021 W1.csv', index = False)